---
kind: type
id: T:Autodesk.Revit.DB.FormulaManager
source: html/d061dadf-70da-a883-ec12-5cf98ded069e.htm
---
# Autodesk.Revit.DB.FormulaManager

A class to access and query information about formula engine in Revit models.

## Syntax (C#)
```csharp
public class FormulaManager : IDisposable
```

## Remarks
Formula manager